holidays_2024: list = [
    '2025-01-01', # Новый год
    '2025-01-02', # Новый год
    # ==============================================
    '2025-03-08', # Международный женский день
    '2025-03-21', # Наурыз
    '2025-03-22', # Наурыз
    '2025-03-25', # Наурыз, перенос с субботы 23 марта
    # ==============================================
    '2025-05-01', # Праздник Единства Народа Казахстана
    '2025-05-07', # День Защитника Отечества
    '2025-05-09', # День Победы
    # ==============================================
    '2025-07-08', # День столицы, перенос с субботы 6 июля
    # ==============================================
    '2025-08-30', # День Конституции
    # ==============================================
    '2025-10-25', # День Республики
    # ==============================================
    '2025-12-16', # День Независимости Казахстана
]

holidays_2025: list = [
    '2025-01-01', # Новый год
    '2025-01-02', # Новый год
    '2025-01-03', # Новый год
    '2025-01-07', # Рождество Христово
    # ==============================================
    '2025-03-10', # Международный женский день
    '2025-03-21', # Наурыз
    '2025-03-24', # Наурыз
    '2025-03-25', # Наурыз
    # ==============================================
    '2025-05-01', # Праздник Единства Народа Казахстана
    '2025-05-07', # День Защитника Отечества
    '2025-05-09', # День Победы
    # ==============================================
    '2025-06-06', # Курбан Айт
    # ==============================================
    '2025-07-07', # День столицы, перенос с воскресенья 6 июля
    # ==============================================
    '2025-09-01', # День Конституции, с субботы 30 августа
    # ==============================================
    '2025-10-27', # День Республики, перенос с субботы 25 октября
    # ==============================================
    '2025-12-16', # День Независимости Казахстана
]

holidays_2026: list = [
    '2026-01-01', # Новый год
    '2026-01-02', # Новый год
    '2026-01-07', # Рождество Христово
    # ==============================================
    '2026-03-09', # Международный женский день, перенос с 8 марта 
    '2026-03-23', # Наурыз
    '2026-03-24', # Наурыз, перенос с субботы 21 марта
    '2026-03-25', # Наурыз, перенос с воскресенья 22 марта
    # ==============================================
    '2026-05-01', # Праздник Единства Народа Казахстана
    '2026-05-07', # День Защитника Отечества
    '2026-05-11', # День Победы, перенос с субботы 9 мая
    '2026-05-27', # Курбан Айт
    # ==============================================
    '2026-07-06', # День Столицы
    # ==============================================
    '2026-08-31', # День Конституции, перенос с воскресенья 30 августа
    # ==============================================
    '2026-10-27', # День Республики, перенос с всоскресенья 25 октября
    # ==============================================
    '2026-12-16', # День Независимости Казахстана
]

holidays_91_26: list = [holidays_2024, holidays_2025, holidays_2026]